//Virtual DOM არის Document Object Model-ის მსუბუქი JavaScript-წარმოდგენა, რომელიც გამოიყენება დეკლარაციულ ვებ-ფრეიმვორკებში, როგორიცაა React, Vue.js და Elm.
//კომპონენტი წარმოადგენს ვებ-გვერდის ან აპლიკაციის ინტერფეისის ერთ-ერთ მთავარ საშენ ბლოკს.
//UseState() არის REACT-ის კაუჭი და გვაძლებს იმის საშვალებას რომ ვაკონტროლოთ კომპონენტის მდგომარეობის შენახვა. 
//UseEffect() არის REACT-ის კაუჭი და მას ვიყენებთ ჩვენს კომპონენტზე გვერდითი ეფექტების შესაქმნელად, რომელსაც API-ების წამოღება DOM-თან მუშაობა და ეფექთის addEventListener-ის გამოყენებად. 
//დამოკიდებულებების მასივი არის მიმზადების მასიცი, რომელიც აკონტროლებს თუ როდის უნდა გაეშვას კონგრეტული ეფექტი
//Presentational/Container Components არის React დიზაინის ნიმუში, რომელიც აწესებს საკითხების მკაცრ გამიჯვნას კომპონენტების ორ განსხვავებულ კატეგორიად დაყოფით: ისინი, რომლებიც ამუშავებენ აპლიკაციის ლოგიკას და ისინი, რომლებიც ამუშავებენ ვიზუალურ რენდერინგს.
//Controlled Component-ში React-ის მდგომარეობა (state) ჭეშმარიტების ერთადერთ წყაროს წარმოადგენს.
//Uncontrolled Component-ში DOM-ი თავად მართავს ფორმის მონაცემებს