#for ციკლი არის საკონტროლო ნაკადის განცხადება, რომელიც გამოიყენება განცხადებების ჯგუფის განმეორებით შესასრულებლად, სანამ პირობა დაკმაყოფილებულია.
#საიტერაციო ცვლადი არის ცვლადი, რომელიც ინახავს iterable-ის ნაწილს for loop-ის შესრულებისას.
#range ფუნქცია აბრუნებს რიცხვების თანმიმდევრობას, ნაგულისხმევად დაწყებული 0-დან და იზრდება 1-ით (ნაგულისხმევად) და ჩერდება მითითებულ რიცხვამდე
for i in range(51):
    print(i)
   
z = 0
for i in range(5):
    y = int(input("Enter a whole number here:"))
    z += y

print("The sum of these numbers is {}.".format(z))