//Scope განსაზღვრავს ცვლადების ხელმისაწვდომობას (ხილვადობას) და არსებობს სამი სახის Scope.
//Global Scope
//Function Scope
//Block Scope
//window ობიექტი წარმოადგენს ბრაუზერში გახსნილ ფანჯარას
//თუ დოკუმენტი შეიცავს ჩარჩოებს, ბრაუზერი ქმნის ერთ ფანჯრის ობიექტს HTML დოკუმენტისთვის და ერთ დამატებით ფანჯრის ობიექტს თითოეული ჩარჩოსთვის.
var country = "Georgia"
console.log(country)
{
let country = "France"
console.log(country)
}
//scope pollution ხდება მაშინ, როდესაც გლობალურ მასშტაბში ძალიან ბევრი ცვლადია გამოცხადებული, ან როდესაც ცვლადები შეცდომით გამოიყენება სხვადასხვა, ერთმანეთთან დაუკავშირებელ მასშტაბებში.