//React აკავშირებს მარკაპსა და ლოგიკას JSX-ის გამოყენებით, რათა HTML-კონტეინერში UI-ელემენტები დაარენდერიროს.
//Vite არის აწყობის (build) ხელსაწყო, რომელიც მიზნად ისახავს თანამედროვე ვებ-პროექტებისთვის უფრო სწრაფი და მოსახერხებელი განვითარების პროცესის უზრუნველყოფას. იგი ორი ძირითადი ნაწილისგან შედგება:
//Babel არის JavaScript-ის უფასო, ღია კოდის მქონე კომპილატორი (კერძოდ, ტრანსპილატორი), რომელიც ძირითადად გამოიყენება თანამედროვე ECMAScript 2015+ (ES6+) კოდის JavaScript-ის უკუთავსებად ვერსიაში გარდასაქმნელად.
